Revit 2027 API
StairsType.RunType Property
 The type for all runs in the stair element.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId RunType { get; set; }
Public Property RunType As ElementId
	Get
	Set
public:
property ElementId^ RunType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member RunType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The specified runTypeId is not a valid run type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace